# 8 ТИП ЗАДАЧ

## № 3697
Все 5-⁠буквенные слова, составленные из букв В, И, Н, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:
1.  ВВВВВ
2.  ВВВВИ
3.  ВВВВН
4.  ВВВВТ
5.  ВВВИВ
...
Запишите слово, которое стоит под номером 1019.
```
a = {0: "В", 1: "И", 2: "Н", 3: "Т"}
k = 0
for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if k == 1019:
                        print(a[i], a[j], a[g], a[m], a[n], end=" ")
```
ответ:
```
ТТТНН
```
## № 78064
Все 5⁠-⁠буквенные слова, в составе которых могут быть только буквы К, Р, О, В, А, Т, Ь, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1.  ААААА
2.  ААААВ
3.  ААААК
4.  ААААО
5.  ААААР
6.  ААААТ
...
Под каким номером в списке идёт последнее слово c нечётным номером, которое содержит не более одной буквы Т, две буквы В и не содержит букв Ь, стоящих рядом?
```
from itertools import product
count = 0
m = []
for p in product(sorted("КРОВАТЬ"), repeat=5):
    count += 1
    s = ''.join(p)
    if count%2 != 0 and ("ЬЬ" not in s) and s.count("В") == 2 and s.count("Т") <= 1:
            m.append(count)
print(max(m))
```
ответ:
```
16277
```
## № 55625

```
```
ответ:
```
```
## № 7667

```
```
ответ:
```
```
## № 17328

```
```
ответ:
```
```
## № 27539

```
```
ответ:
```
```
## № 18491

```
```
ответ:
```
```
## № 37143

```
```
ответ:
```
```
## № 59745

```
```
ответ:
```
```
## № 10473

```
```
ответ:
```
```
## № 60250

```
```
ответ:
```
```
## № 64938

```
```
ответ:
```
```
## № 9796

```
```
ответ:
```
```
## № 27009

```
```
ответ:15822
```
```
## № 15822

```
```
ответ:
```
```
## № 28546

```
```
ответ:
```
```

## № 15795

```
```
ответ:
```
```

## № 3700

```
```
ответ:
```
```

## № 3237

```
```
ответ:
```
```
## № 13486  

```
```
ответ:
```
```
## № 59741

```
```
ответ:
```
```



